{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "addiction",
    "1": "anger-management",
    "2": "anxiety",
    "3": "behavioral-change",
    "4": "children-adolescents",
    "5": "counseling-fundamentals",
    "6": "depression",
    "7": "diagnosis",
    "8": "domestic-violence",
    "9": "eating-disorders",
    "10": "family-conflict",
    "11": "grief-and-loss",
    "12": "human-sexuality",
    "13": "intimacy",
    "14": "legal-regulatory",
    "15": "lgbtq",
    "16": "marriage",
    "17": "military-issues",
    "18": "parenting",
    "19": "professional-ethics",
    "20": "relationship-dissolution",
    "21": "relationships",
    "22": "self-esteem",
    "23": "sleep-improvement",
    "24": "social-relationships",
    "25": "spirituality",
    "26": "stress",
    "27": "substance-abuse",
    "28": "trauma",
    "29": "workplace-relationships"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "addiction": 0,
    "anger-management": 1,
    "anxiety": 2,
    "behavioral-change": 3,
    "children-adolescents": 4,
    "counseling-fundamentals": 5,
    "depression": 6,
    "diagnosis": 7,
    "domestic-violence": 8,
    "eating-disorders": 9,
    "family-conflict": 10,
    "grief-and-loss": 11,
    "human-sexuality": 12,
    "intimacy": 13,
    "legal-regulatory": 14,
    "lgbtq": 15,
    "marriage": 16,
    "military-issues": 17,
    "parenting": 18,
    "professional-ethics": 19,
    "relationship-dissolution": 20,
    "relationships": 21,
    "self-esteem": 22,
    "sleep-improvement": 23,
    "social-relationships": 24,
    "spirituality": 25,
    "stress": 26,
    "substance-abuse": 27,
    "trauma": 28,
    "workplace-relationships": 29
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.2",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
